<template>
  <div class="about">
    <h1>{{ $t("description") }}</h1>
    <p>
      Получить данные из файла data.json и вывести их на страницу как это
      показано на рис."пример.png".
    </p>

    <img class="description-image" src="@/assets/images/example.png" alt="" />

    <p>
      Показанные на рисунке параметры находятся в узле Goods. "C" - цена в
      долларах(USD) - вывести в рублях(курс выбрать произвольно), "G" - id
      группы, "T" - id товара, "P" - сколько единиц товара осталось (параметр,
      который указан в скобках в названии).
    </p>

    <p>
      Сопоставления id групп и товаров с их названиями находятся в файле
      names.json.
    </p>

    <p>
      После вывода данных навесить обработчики для добавления выбранного товара
      в корзину и удаления из нее. Пример корзины показан в файле "Корзина.png".
      Сделать рассчет общей суммы товаров и вывести отдельным полем. Корзина
      находится на одной и той же странице вместе со списком товаров.
    </p>

    <img class="description-image" src="@/assets/images/cart.png" alt="" />

    <p>(*)</p>
    <p>
      Вывести данные используя привязку к представлению и возможностью
      последующего изменения (two-way binding). Можно использовать фреймворки.
      Сделать обновление цены товара в зависимости от курса валюты. С интервалом
      в 15 секунд читать исходный файл data.json и одновременно менять курс
      доллара (вручную) на значение от 20 до 80, выполняя обновление данных в
      модели (с изменением в представлении). Если цена увеличилось в большую
      сторону - подсветить ячейку красным, если в меньшую - зеленым.
    </p>

    <p>
      Дополнительная информация: Дизайну, показанному в примерах, следовать не
      обязательно. Прокомментировать основные действия. Интересные решения
      приветствуются.
    </p>
  </div>
</template>

<style lang="sass">
.about
  text-align: justify

.description-image
  width: 100%
</style>

<i18n>
{
  "ru": {
    "description": "Описание"
  }
}
</i18n>
